examples-results/HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest.html

<html><head><title>HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest</title><meta http-equiv='Content-Type' content='text/html;charset=UTF-8'/><link rel='stylesheet' type='text/css' href='css/fitnesse.css'/><script src='javascript/jquery-1.7.2.min.js' type='text/javascript'></script><script src='javascript/fitnesse.js' type='text/javascript'></script></head><body><header><h2>HsacExamples.SlimTests.HttpTests.HttpPost2UsingScenarioTest</h2></header><article><br/><h2>Body via scenario</h2>
<br/>Using a scenario allows us to generate multiple request, only changing certain values.<br/><br/><div class="collapsible closed"><ul><li><a href='#' class='expandall'>Expand</a></li><li><a href='#' class='collapseall'>Collapse</a></li></ul>
	<p class="title">Scenario definition</p>
	<div><span class="meta">variable defined: POST_BODY_2= {{{
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;@{zip}&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
}}} </span>
<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td><span class="pass">xml http test</span></td>
	</tr>
</table>
<br/><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td>post</td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;@{zip}&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2">200</td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	</tr>
	<tr>
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr>
		<td>$City=</td>
		<td>xPath</td>
		<td colspan="2">//weather:City/text()</td>
	</tr>
</table>
</div>
</div>
<br/><table>
	<tr>
		<td colspan="2">send request</td>
	</tr>
	<tr>
		<td>zip</td>
		<td>City?</td>
	</tr>
	<tr class="scenario closed">
		<td>10007</td>
		<td><span class="pass">New York</span></td>
	</tr><tr class="scenario-detail closed-detail"><td colspan="2"><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td><span class="pass">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;10007&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">200</span></td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;GetCityWeatherByZIPResponse xmlns=&quot;http://ws.cdyne.com/WeatherWS/&quot;&gt;
            &lt;GetCityWeatherByZIPResult&gt;
                &lt;Success&gt;true&lt;/Success&gt;
                &lt;ResponseText&gt;City Found&lt;/ResponseText&gt;
                &lt;State&gt;NY&lt;/State&gt;
                &lt;City&gt;New York&lt;/City&gt;
                &lt;WeatherStationCity&gt;White Plains&lt;/WeatherStationCity&gt;
                &lt;WeatherID&gt;15&lt;/WeatherID&gt;
                &lt;Description&gt;N/A&lt;/Description&gt;
                &lt;Temperature&gt;63&lt;/Temperature&gt;
                &lt;RelativeHumidity&gt;87&lt;/RelativeHumidity&gt;
                &lt;Wind&gt;E7&lt;/Wind&gt;
                &lt;Pressure&gt;29.97S&lt;/Pressure&gt;
                &lt;Visibility/&gt;
                &lt;WindChill/&gt;
                &lt;Remarks/&gt;
            &lt;/GetCityWeatherByZIPResult&gt;
        &lt;/GetCityWeatherByZIPResponse&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
	<tr>
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr>
		<td>$City&lt;-[New York]</td>
		<td>xPath</td>
		<td colspan="2">//weather:City/text()</td>
	</tr>
</table></td></tr>
	<tr class="scenario closed">
		<td>94102</td>
		<td><span class="pass">San Francisco</span></td>
	</tr><tr class="scenario-detail closed-detail"><td colspan="2"><table>
	<tr>
		<td>table template</td>
		<td colspan="3">send request</td>
	</tr>
	<tr>
		<td><span class="pass">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:GetCityWeatherByZIP xmlns:ns1="http://ws.cdyne.com/WeatherWS/"&gt;
      &lt;ns1:ZIP&gt;94102&lt;/ns1:ZIP&gt;
    &lt;/ns1:GetCityWeatherByZIP&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td><a href="http://wsf.cdyne.com/WeatherWS/Weather.asmx">http://wsf.cdyne.com/WeatherWS/Weather.asmx</a></td>
	</tr>
	<tr>
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">200</span></td>
	</tr>
	<tr>
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;soap:Body&gt;
        &lt;GetCityWeatherByZIPResponse xmlns=&quot;http://ws.cdyne.com/WeatherWS/&quot;&gt;
            &lt;GetCityWeatherByZIPResult&gt;
                &lt;Success&gt;true&lt;/Success&gt;
                &lt;ResponseText&gt;City Found&lt;/ResponseText&gt;
                &lt;State&gt;CA&lt;/State&gt;
                &lt;City&gt;San Francisco&lt;/City&gt;
                &lt;WeatherStationCity&gt;San Francisco&lt;/WeatherStationCity&gt;
                &lt;WeatherID&gt;14&lt;/WeatherID&gt;
                &lt;Description&gt;Cloudy&lt;/Description&gt;
                &lt;Temperature&gt;63&lt;/Temperature&gt;
                &lt;RelativeHumidity&gt;87&lt;/RelativeHumidity&gt;
                &lt;Wind&gt;W10&lt;/Wind&gt;
                &lt;Pressure&gt;29.98R&lt;/Pressure&gt;
                &lt;Visibility/&gt;
                &lt;WindChill/&gt;
                &lt;Remarks/&gt;
            &lt;/GetCityWeatherByZIPResult&gt;
        &lt;/GetCityWeatherByZIPResponse&gt;
    &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;
</pre></td></tr>
	<tr>
		<td>register prefix</td>
		<td>weather</td>
		<td>for namespace</td>
		<td><a href="http://ws.cdyne.com/WeatherWS/">http://ws.cdyne.com/WeatherWS/</a></td>
	</tr>
	<tr>
		<td>$City&lt;-[San Francisco]</td>
		<td>xPath</td>
		<td colspan="2">//weather:City/text()</td>
	</tr>
</table></td></tr>
</table>
</article></body></html>